app/controllers/task_types_controller.rb

  def new
    @task_type = TaskType.new
    @task_type.project = Project.find(params[:project_id])
---
SELECT "projects".* FROM "projects" INNER JOIN "project_memberships" ON "projects".id = "project_memberships".project_id WHERE (("project_memberships".user_id = 1) AND ((leaved is null)))

  def edit
    @task_type = TaskType.find(params[:id])
---
SELECT * FROM "task_types" WHERE ("task_types"."id" = 1)

  def create
    @task_type = TaskType.new(params[:task_type])

    respond_to do |format|
      if @task_type.save
---
INSERT INTO "task_types" ("name", "created_at", "project_id", "updated_at") VALUES('descriptografar passwords', '2009-05-02 23:37:34', 1, '2009-05-02 23:37:34')

  def update
    @task_type = TaskType.find(params[:id])

    respond_to do |format|
      if @task_type.update_attributes(params[:task_type])
---
SELECT * FROM "task_types" WHERE ("task_types"."id" = 1)
UPDATE "task_types" SET "updated_at" = '2009-05-03 10:13:34', "name" = 'descriptografar passwords dos usuários' WHERE "id" = 1