app/controllers/time_logs_controller.rb

SELECT * FROM "time_logs"
---
  def index
    @time_logs = TimeLog.all